#+title: The Time Value of Money: Single Cash Flows
#+author: Matt Brigida, Ph.D.
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup

** Python calculation

#+BEGIN_SRC python :results output :exports both
def future_value(pv, rate, periods):
    return pv * pow(1 + rate, periods)

pv = 100
rate = 0.07
periods = 10

print(round(future_value(pv, rate, periods), 2))

#+END_SRC

#+RESULTS:
: 196.72


** Python Calculation

#+BEGIN_SRC python :results output :exports both
def present_value(fv, rate, periods):
    return fv / pow(1 + rate, periods)

fv = 200
rate = 0.07
periods = 10

print(round(present_value(fv, rate, periods), 2))

#+END_SRC

#+RESULTS:
: 101.67

 

** Python Calculation

#+BEGIN_SRC python :results output :exports both
def rate(fv, pv, periods):
    return pow(fv / pv, 1 / periods) - 1

fv = 200
pv = 100
periods = 10

print(str(round(100 * rate(fv, pv, periods), 2)) + "%")
#+END_SRC

#+RESULTS:
: 7.18%

 

* The Number of Periods

Lastly, solving for the number of periods yields: 

$n = \frac{ln\left(\frac{FV}{PV}\right)}{ln\left(1+r\right)}$

- Holding other variables constant, the number of periods $n$ is also increasing in $FV$, and decreasing in $PV$ and $r$.

#+BEGIN_SRC python :results output :exports both
import math

def periods(fv, pv, rate):
    return math.log(fv / pv) / math.log(1 + rate)

fv = 200
pv = 100
rate = 0.07

print(str(round(periods(fv, pv, rate), 2)) + " periods")
#+END_SRC

#+RESULTS:
: 10.24 periods


